# Pandas - DataFrame

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

### 5. 인덱스 조작

In [4]:
np.random.seed(2021)
a = np.array(list('ABCDE'))
b = np.random.randint(20, size=(3,5))
c = np.vstack((a, b))
c

array([['A', 'B', 'C', 'D', 'E'],
       ['0', '13', '12', '12', '6'],
       ['6', '6', '1', '5', '7'],
       ['1', '14', '1', '5', '2']], dtype='<U21')

In [5]:
df = pd.DataFrame(c.T, columns=['C1','C2','C3','C4'])
df

  C1  C2 C3  C4
0  A   0  6   1
1  B  13  6  14
2  C  12  1   1
3  D  12  5   5
4  E   6  7   2

- set_index

In [8]:
df.set_index('C1', inplace=True)
df

    C2 C3  C4
C1
A    0  6   1
B   13  6  14
C   12  1   1
D   12  5   5
E    6  7   2

In [9]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object', name='C1')

In [10]:
df.index.name = 'Index'
df

       C2 C3  C4
Index
A       0  6   1
B      13  6  14
C      12  1   1
D      12  5   5
E       6  7   2

In [13]:
df.columns.name = 'Columns'
df

Columns  C2 C3  C4
Index
A         0  6   1
B        13  6  14
C        12  1   1
D        12  5   5
E         6  7   2

- reset_index

In [16]:
df.reset_index(inplace=True)

In [17]:
df

Columns Index  C2 C3  C4
0           A   0  6   1
1           B  13  6  14
2           C  12  1   1
3           D  12  5   5
4           E   6  7   2

In [18]:
df.rename(columns={'Index':'C1'}, inplace=True)
df

Columns C1  C2 C3  C4
0        A   0  6   1
1        B  13  6  14
2        C  12  1   1
3        D  12  5   5
4        E   6  7   2

### 6. 합성

- merge 함수

In [19]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [20]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [21]:
# Inner join
pd.merge(df1, df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [22]:
# Left outer join
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [23]:
# Right outer join
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

In [24]:
# Full outer join
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

- join method

In [25]:
df1.join(df2)

ValueError: ignored

In [26]:
df3 = df1.set_index('고객번호')
df4 = df2.set_index('고객번호')
df3.join(df4)                   # Full outer join이 디폴트

       이름       금액
고객번호
1001   둘리  10000.0
1001   둘리  20000.0
1001   둘리  30000.0
1002  도우너      NaN
1003   또치      NaN
1004   길동      NaN
1005   희동  15000.0
1006  마이콜   5000.0
1007   영희      NaN

In [28]:
df5 = df3.join(df4, how='inner')
df5

       이름     금액
고객번호
1001   둘리  10000
1001   둘리  20000
1001   둘리  30000
1005   희동  15000
1006  마이콜   5000

### 7. 그룹 분석

In [34]:
iris = sns.load_dataset('iris')
iris.groupby('species').mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [35]:
# sepal_length 피쳐에 대한 품종별 표준편차
iris.groupby('species')['sepal_length'].std()

species
setosa        0.352490
versicolor    0.516171
virginica     0.635880
Name: sepal_length, dtype: float64

In [37]:
iris[['sepal_length','species']].groupby('species').mean()

            sepal_length
species
setosa             5.006
versicolor         5.936
virginica          6.588

In [38]:
iris.groupby('species')[['sepal_length']].std()

            sepal_length
species
setosa          0.352490
versicolor      0.516171
virginica       0.635880

In [39]:
# sepal_length 피쳐에 대한 품종별 평균과 표준편차
iris.groupby('species')['sepal_length'].agg(['mean','std'])

             mean       std
species
setosa      5.006  0.352490
versicolor  5.936  0.516171
virginica   6.588  0.635880

- tips data

In [40]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [41]:
tips['tip_pct'] = (tips.tip / tips.total_bill * 100).round(2)
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2     5.94
1       10.34  1.66    Male     No  Sun  Dinner     3    16.05
2       21.01  3.50    Male     No  Sun  Dinner     3    16.66
3       23.68  3.31    Male     No  Sun  Dinner     2    13.98
4       24.59  3.61  Female     No  Sun  Dinner     4    14.68

In [42]:
# 성별 팁 비율
tips.groupby('sex')[['tip_pct']].mean()

          tip_pct
sex
Male    15.764713
Female  16.648276

In [43]:
# 흡연유무에 따른 팁 비율
tips.groupby('smoker')[['tip_pct']].mean()

          tip_pct
smoker
Yes     16.319140
No      15.932318

In [44]:
# 성별/흡연유무에 따른 팁 비율
tips.groupby(['sex','smoker'])[['tip_pct']].mean()

                 tip_pct
sex    smoker
Male   Yes     15.276667
       No      16.066598
Female Yes     18.214545
       No      15.691111

In [46]:
# 성별/흡연유무/시간대별 팁 비율
a = tips.groupby(['sex','smoker','time'])[['tip_pct']].mean()
a

                        tip_pct
sex    smoker time
Male   Yes    Lunch   16.665385
              Dinner  14.892553
       No     Lunch   16.570000
              Dinner  15.935844
Female Yes    Lunch   17.526000
              Dinner  18.513913
       No     Lunch   15.707600
              Dinner  15.676897

In [47]:
a['tip_pct']['Male']

smoker  time
Yes     Lunch     16.665385
        Dinner    14.892553
No      Lunch     16.570000
        Dinner    15.935844
Name: tip_pct, dtype: float64

In [53]:
a['tip_pct']['Male','Yes','Lunch']

16.665384615384617